trade_exp/src/Documents/ВозвратТоваровОтКлиента/ВозвратТоваровОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВозвратТоваровОтКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes>
    <name>ЗаявкаНаВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПокупательНеПлательщикНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредусмотренЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерРасходногоКассовогоОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРасходногоКассовогоОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособКомпенсации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВозвратПереданнойМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВыданыДенежныеСредства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизацииСпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДействияМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользуетсяДоговор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="079ec34d-066c-4845-ba17-d2482693b556">
    <name>СторноОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="70e9e5a0-95a9-4618-b6cd-151f7f41f9bb">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a32023d-cb56-4527-9754-92bc93e44ff6">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="40e5b2a4-c7be-4ede-bf7d-35de5f953c24">
    <name>СпособВводаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6be545fb-1e1a-4d30-9554-2390bd3961a1">
    <name>ПодразделениеМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fba413bc-839f-40ef-a9b2-7279747c08dc">
    <name>ОтделМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Порча</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНачисленныхБонусныхБалловВВалюте</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписаниюВВалюте</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписанию</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1fb5892b-e8f0-4be4-ad14-feed7c553f12">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="72d0be57-210d-4f57-bb99-9a68a3e4fc94">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="72338e32-64c3-4932-9afe-432c94be8596">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="dda0c316-494c-49fa-8dc3-0f2b7fb432c7">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83a397d6-087d-43ea-8a1b-535791c0ad6f">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="47a744cb-233b-44b2-908e-7ead60620ba2">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачислениеБонусныхБаллов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаБонуснымиБаллами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/АналитикаУчетаНоменклатуры/АналитикаУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f1474f8-aa38-42d7-b209-c80ad3db4af3">
  <name>АналитикаУчетаНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="1c90c910-56a7-42a1-8d15-4b96ce66a164">
    <name>КлючАналитики</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="2faf9d15-792d-47af-a0c3-eefd90bdfd81">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="14ae852a-8db3-44b4-baa2-bb9989fd5c10">
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b016d84c-f5ee-47fa-8f8b-2db70fd2d576">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ВозвратТоваровОтКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Договор");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
КонецПроцедуры

&Перед("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ЗаказКлиента) И ТипЗнч(ДанныеЗаполнения.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			СпособВводаКлиента = ДанныеЗаполнения.СпособВводаКлиента;
			ТоварПодЗаказ = ДанныеЗаполнения.ЗаказКлиента.ТоварПодЗаказ;
			Если ТоварПодЗаказ Тогда
				Если Не рольДоступна("ПолныеПрава") И Не рольДоступна("ВозможностьВозвратаТовараПодЗаказ") Тогда
					ВызватьИсключение("В заказе, на основе которого создана реализация, присутствует товар под заказ! Обратитесь к Администратору торгового зала!");
					Возврат;
				Иначе
					Сообщить("В заказе, на основе которого создана реализация, присутствует товар под заказ!");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЧекККМ") Тогда
		Если ДанныеЗаполнения.Партнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания тогда
			Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("0562ed9b-4ca4-11e1-8e7d-001e101f9843"));
			СпособВводаКлиента = ДанныеЗаполнения.СпособВводаКлиента;
		КонецЕсли;	
	КонецЕсли;
	
	Если Не ДанныеЗаполнения = Неопределено И Не БонусыАльтерраРезерв.ПолучитьЗначениеРеквизита(ДанныеЗаполнения, "Магазин") = Ложь Тогда
		Магазин = ДанныеЗаполнения.Магазин;
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполненияПосле(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")  Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если ДанныеЗаполнения.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
				ПорядокРасчетов = ДанныеЗаполнения.ПорядокРасчетов;
			КонецЕсли;
			ИспользуетсяДоговор = ДанныеЗаполнения.ИспользуетсяДоговор;
		КонецЕсли;	
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЧекККМ") Тогда
		Соглашение= ДанныеЗаполнения.Соглашение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И Типзнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Менеджер = ДанныеЗаполнения.Менеджер;
		Если Не БонусыАльтерраРезерв.ПолучитьЗначениеРеквизита(ДанныеЗаполнения, "ПодразделениеМенеджера") = Ложь 
				и Не БонусыАльтерраРезерв.ПолучитьЗначениеРеквизита(ДанныеЗаполнения, "ОтделМенеджера") = Ложь Тогда
			ПодразделениеМенеджера = ДанныеЗаполнения.ПодразделениеМенеджера;
			ОтделМенеджера = ДанныеЗаполнения.ОтделМенеджера;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПодразделениеМенеджера) и Не ЗначениеЗаполнено(ОтделМенеджера) Тогда
		ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Менеджер); 
		ОтделМенеджера = ПолучитьОтделМенеджера(Менеджер);
	КонецЕсли;
	
КонецПроцедуры

&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
	
	Для Каждого ТекСтрока Из Товары Цикл
		ТекСтрока.Кладовщик = "";
	КонецЦикла; 
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, ПараметрыЗаписи)	
	
	Если ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		И ЗначениеЗаполнено(ДокументРеализации.Кассир) = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Запись документа без отметки кассы в документе продажи запрещена.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	//Проверить на новом релизе, убрать при необходимости
	Если ДокументРеализации = Неопределено Тогда
		ПроверитьИЗаполнитьСпособОпределенияСебестоимости();
	КонецЕсли;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Отказ И ЗначениеЗаполнено(Ссылка) И Не Проведен И ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Попытка
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда	
				Если Не ПометкаУдаления Тогда                               // Записанный документ проводится
					НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
					Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
						ДополнительныеСвойства.Вставить("НаличиеКорректировки", НаличиеКорректировки);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда      // Пометка на удаление записанного документа
					Если Не РольДоступна("ПолныеПрава") Тогда
						АльтерраОбщегоНазначения.ПроверитьНаличиеПриходныхОрдеров(Ссылка, Ложь, Ложь, "Сначала необходимо пометить на удаление следуюшие документы:", Отказ);
			        КонецЕсли;
					
					Если Не Отказ Тогда
						НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
						Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
							НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Ссылка.ПометкаУдаления И Не ПометкаУдаления Тогда // Пометка на удаление снимается
					НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Истина);
					Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			ВызватьИсключение;
		КонецПопытки;	
	КонецЕсли; 		
КонецПроцедуры
	
&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицаДвижений = БонусыАльтерраРезерв.ПолучитьТаблицуБонусныхБаловДляПроведенияВозврата(ЭтотОбъект, Отказ);
	
	Если ТаблицаДвижений.Количество() > 0 Тогда
		ДатаОтложенногоНачисления = НачалоДня(ДокументРеализации.Дата)+3600*24*3;
		Для каждого Стр Из ТаблицаДвижений Цикл
			Если Стр.ВидДвижения = ВидДвиженияНакопления.Расход И Стр.Период < ДатаОтложенногоНачисления Тогда
				Стр.Период = ДатаОтложенногоНачисления; //Контрзапись по дате начисления, чтобы баллы не уходили в минус
			КонецЕсли;
		КонецЦикла;
		Движения.БонусныеБаллы.Загрузить(ТаблицаДвижений);
		Движения.БонусныеБаллы.Записывать = Истина;
	КонецЕсли; 
	
    УстановитьПривилегированныйРежим(Истина);
	Если Не СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(Склад, Дата) Тогда 
		Заказ = Документы.ЗаказКлиента.ПустаяСсылка();
		
		Если ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Заказ = ДокументРеализации.ЗаказКлиента;
		КонецЕсли;
		
		Если Не Заказ = Неопределено Тогда
			Если Не Заказ.Пустая() Тогда
				
				Назначение = Документы.КорректировкаНазначенияТоваров.НазначениеЗаказа(Заказ);
			
				//Если Документы.КорректировкаНазначенияТоваров.ЕстьДоступныйРезервОстаток(Назначение, Заказ, Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв)  Тогда
				Если Документы.КорректировкаНазначенияТоваров.ЕстьТоварыКСнятиюРезерва(Назначение) Тогда
					Если ДополнительныеСвойства.Свойство("НаличиеКорректировки") Тогда
						Попытка
							ДополнительныеСвойства.НаличиеКорректировки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							ВызватьИсключение;
						КонецПопытки;
					Иначе
						КорректировкаНазначения = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
						
						ОрганизацияЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Организация");
						
						КорректировкаНазначения.Организация = ОрганизацияЗаказа;
						КорректировкаНазначения.Назначение = Назначение;
						КорректировкаНазначения.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв;
						КорректировкаНазначения.Дата = ТекущаяДатаСеанса();
						КорректировкаНазначения.УстановитьНовыйНомер(); 
						КорректировкаНазначения.Автор = Справочники.Пользователи.НайтиПоНаименованию("Администратор"); 
						КорректировкаНазначения.Ответственный = ПараметрыСеанса.ТекущийПользователь;
						КорректировкаНазначения.Комментарий = "Создана автоматически при создании документа "" " + Ссылка + """";
						
						
						Для Каждого СтрокаТовара Из Товары Цикл
							Если СтрокаТовара.Назначение = Назначение Тогда
								СтрокаПродукция = КорректировкаНазначения.Товары.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаПродукция, СтрокаТовара);
							КонецЕсли;
						КонецЦикла;
						
						ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(КорректировкаНазначения, Документы.КорректировкаНазначенияТоваров));
						НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(КорректировкаНазначения, ПараметрыУказанияСерий);
						
						Документы.КорректировкаНазначенияТоваров.ЗаполнитьПоОснованию(Назначение,ОрганизацияЗаказа,КорректировкаНазначения.Ссылка, Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв, КорректировкаНазначения.Товары);
						
						Если КорректировкаНазначения.Товары.Количество()>0 Тогда
							КорректировкаНазначения.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе	
		Если ДополнительныеСвойства.Свойство("НаличиеКорректировки") Тогда
			Попытка
				ДополнительныеСвойства.НаличиеКорректировки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ВызватьИсключение;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
   УстановитьПривилегированныйРежим(Ложь);
   
   Если ЭтотОбъект.Проведен Тогда
	   Если ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") ИЛИ ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.ЧекККМ") Тогда
		   Документы.ЗаявкаВЕГАИСЛес.ПроверкаЕГАИС(ЧекККМ, ЭтотОбъект);
	   ИначеЕсли ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
    		Документы.ЗаявкаВЕГАИСЛес.ПроверкаЕГАИС(ДокументРеализации, ЭтотОбъект); 
	   КонецЕсли;
   КонецЕсли;
 
КонецПроцедуры

Функция ЕстьТоварыКОбособленномуОбеспечению(Назначение,МассивНоменклатуры) 
	
	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбеспечениеЗаказов.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказов КАК ОбеспечениеЗаказов
	|ГДЕ
	|	ОбеспечениеЗаказов.Назначение = &Назначение
	|	И ОбеспечениеЗаказов.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Не Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

&Перед("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
	
	Если Не Отказ И ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Попытка
			Если Не РольДоступна("ПолныеПрава") Тогда
				Если ПометкаУдаления Тогда     // Пометка на удаление проведенного документа
					АльтерраОбщегоНазначения.ПроверитьНаличиеПриходныхОрдеров(Ссылка, Истина, Ложь, "Сначала необходимо пометить на удаление следуюшие документы:", Отказ);
				Иначе                          // Распроведение документа
					АльтерраОбщегоНазначения.ПроверитьНаличиеПриходныхОрдеров(Ссылка, Истина, Ложь, "Сначала необходимо снять с проведения следуюшие документы:", Отказ);
				КонецЕсли;
			КонецЕсли;
			
			Если Не Отказ Тогда
				НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Истина, Ложь);
				Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
					Если ПометкаУдаления Тогда // Пометка на удаление проведенного документа
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
					Иначе                      // Распроведение документа
						НаличиеКорректировки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			ВызватьИсключение; 
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения1(Отказ)
	АльтерраОбщегоНазначения.КонтрольОтметкиКассы(ЭтотОбъект, Отказ);
КонецПроцедуры   

Процедура ПроверитьИЗаполнитьСпособОпределенияСебестоимости() 
	
	Для каждого Строка из Товары Цикл
		Если Строка.СпособОпределенияСебестоимости.Пустая() Тогда
			 Строка.СпособОпределенияСебестоимости = Перечисления.СпособыОпределенияСебестоимости.ИзТекущегоДокумента;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение.Наименование КАК Отдел
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО (ДополнительныеСведения.Объект = Пользователи.Ссылка)
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ДополнительныеСведения.Свойство.Наименование = ""Отделы (Пользователи)""";
	
	Запрос.УстановитьПараметр("Ссылка", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Отдел;
КонецФункции

&НаСервере
Функция ПолучитьПодразделениеМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Подразделение;
КонецФункции

#КонецЕсли

&ИзменениеИКонтроль("ЗаполнитьДокументНаОснованииРеализацииТоваровИУслуг")
Процедура Док_ЗаполнитьДокументНаОснованииРеализацииТоваровИУслуг(Знач ДокументОснование, ПараметрыОформления)

	ВводитьНаОснованииНепроведенного = Ложь;
	Если Не ПараметрыОформления = Неопределено
		И ТипЗнч(ПараметрыОформления) = Тип("Структура") Тогда

		ПараметрыОформления.Свойство("ВводитьНаОснованииНепроведенного", ВводитьНаОснованииНепроведенного);
		ВводитьНаОснованииНепроведенного = ?(ВводитьНаОснованииНепроведенного = Неопределено,
		Ложь,
		ВводитьНаОснованииНепроведенного);

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТовары.ОбъектРасчетов КАК ОбъектРасчетов
	|ПОМЕСТИТЬ ОбъектыРасчетов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 1
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации,
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Соглашение КАК Соглашение,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.КонтактноеЛицо КАК КонтактноеЛицо,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РеализацияТоваровУслуг.Сделка КАК Сделка,
	|	РеализацияТоваровУслуг.Подразделение КАК Подразделение,
	|	РеализацияТоваровУслуг.Статус КАК СтатусДокумента,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Склад.ЭтоГруппа
	|				И РеализацияТоваровУслуг.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ РеализацияТоваровУслуг.Склад
	|	КОНЕЦ КАК Склад,
	|	РеализацияТоваровУслуг.ХозяйственнаяОперация КАК ХозяйственнаяОперацияРеализация,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.ВернутьМногооборотнуюТару КАК ВозвратПереданнойМногооборотнойТары,
	|	РеализацияТоваровУслуг.ТребуетсяЗалогЗаТару КАК ПредусмотренЗалогЗаТару,
	|	НЕ РеализацияТоваровУслуг.Проведен
	|		И НЕ &ВводитьНаОснованииНепроведенного КАК ЕстьОшибкиПроведен,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.Отгружено)
	|				ИЛИ РеализацияТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиСтатус,
	|	РеализацияТоваровУслуг.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РеализацияТоваровУслуг.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	РеализацияТоваровУслуг.ОплатаВВалюте КАК ОплатаВВалюте,
	|	РеализацияТоваровУслуг.КлиентКонтрагент КАК КлиентКонтрагент,
	|	РеализацияТоваровУслуг.КлиентПартнер КАК КлиентПартнер,
	|	РеализацияТоваровУслуг.КлиентДоговор КАК КлиентДоговор
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ДокументОснование
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 2
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентами.Валюта КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(РасчетыСКлиентами.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(
	|			,
	|			ОбъектРасчетов В
	|				(ВЫБРАТЬ
	|					ОбъектыРасчетов.ОбъектРасчетов
	|				ИЗ
	|					ОбъектыРасчетов)) КАК РасчетыСКлиентами
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 3
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КорректировкаРеализации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДанныеПоследнейКорректировки
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументовСторноИсправление
	|		ПО КорректировкаРеализации.Ссылка = РеестрДокументовСторноИсправление.СторнируемыйДокумент
	|			И РеестрДокументовСторноИсправление.Проведен
	|			И НЕ РеестрДокументовСторноИсправление.ДополнительнаяЗапись
	|ГДЕ
	|	КорректировкаРеализации.Проведен
	|	И РеестрДокументовСторноИсправление.Ссылка ЕСТЬ NULL
	|	И КорректировкаРеализации.ДокументОснование = &ДокументОснование
	|	И НЕ КорректировкаРеализации.ВидКорректировки В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара),
	|													ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара))
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорректировкаРеализации.МоментВремени УБЫВ
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 4
	|ВЫБРАТЬ
	|	ЕСТЬNULL(АналитикаНаборов.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНаборов.ПустаяСсылка)) КАК АналитикаУчетаНаборов,
	|	ТаблицаТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	ТаблицаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	АналитикаНоменклатуры.КлючАналитики КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ТаблицаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаТовары.Количество КАК Количество,	
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТовары.СуммаСНДС КАК СуммаСНДС,
	|	ТаблицаТовары.Склад КАК Склад
	|ПОМЕСТИТЬ ТоварыДокументаПродажи
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоследнейКорректировки КАК ДанныеПоследнейКорректировки
	|		ПО ТаблицаТовары.Ссылка = ДанныеПоследнейКорректировки.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНаборов КАК АналитикаНаборов
	|		ПО ТаблицаТовары.НоменклатураНабора = АналитикаНаборов.НоменклатураНабора
	|			И ТаблицаТовары.ХарактеристикаНабора = АналитикаНаборов.ХарактеристикаНабора
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО ТаблицаТовары.Номенклатура = АналитикаНоменклатуры.Номенклатура
	|			И ТаблицаТовары.Характеристика = АналитикаНоменклатуры.Характеристика
	|			И ТаблицаТовары.Назначение = АналитикаНоменклатуры.Назначение
	|			И ТаблицаТовары.Серия = АналитикаНоменклатуры.Серия
	|			И ТаблицаТовары.Склад = АналитикаНоменклатуры.МестоХранения
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.АналитикаУчетаНаборов,
	|	ТаблицаТовары.НоменклатураНабора,
	|	ТаблицаТовары.ХарактеристикаНабора,
	|	ТаблицаТовары.АналитикаУчетаНоменклатуры,
	|	ТаблицаТовары.Номенклатура,
	|	СправочникНоменклатура.ТипНоменклатуры,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Назначение,
	|	ТаблицаТовары.Серия,
	|	ТаблицаТовары.Упаковка,
	|	ТаблицаТовары.КоличествоУпаковок,
	|	ТаблицаТовары.Количество,
	#Удаление
	|	ТаблицаТовары.Сумма,
	#КонецУдаления
	#Вставка
	|	ТаблицаТовары.Сумма+ ТаблицаТовары.СуммаРТ,
	#КонецВставки
	|	ТаблицаТовары.СтавкаНДС,
	#Удаление
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.СуммаСНДС,
	#КонецУдаления
	#Вставка
	|	ТаблицаТовары.СуммаНДС + ТаблицаТовары.СуммаНДСРТ,            
	|	ТаблицаТовары.СуммаСНДС + ТаблицаТовары.СуммаСНДСРТ,
	#КонецВставки
	|	ТаблицаТовары.Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоследнейКорректировки КАК ДанныеПоследнейКорректировки
	|		ПО ИСТИНА
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументовСторноИсправление
	|		ПО ТаблицаТовары.Ссылка = РеестрДокументовСторноИсправление.СторнируемыйДокумент
	|			И РеестрДокументовСторноИсправление.Проведен
	|			И НЕ РеестрДокументовСторноИсправление.ДополнительнаяЗапись
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ДанныеПоследнейКорректировки.Ссылка ЕСТЬ NULL
	|	И РеестрДокументовСторноИсправление.Ссылка ЕСТЬ NULL
	#Вставка
	|	И ВЫБОР
	|   			КОГДА ТаблицаТовары.Ссылка.РаспределитьТранспортные
	|   				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|   			ИНАЧЕ ИСТИНА
	|   		КОНЕЦ
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураНабора,
	|	ХарактеристикаНабора
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 5
	|ВЫБРАТЬ
	|	ТоварыДокументаПродажи.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ТоварыДокументаПродажи.НоменклатураНабора КАК НоменклатураНабора,
	|	ТоварыДокументаПродажи.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.СодержитУслуги, ЛОЖЬ) КАК НаборСодержитУслуги,
	|	ТоварыДокументаПродажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТоварыДокументаПродажи.Номенклатура КАК Номенклатура,
	|	ТоварыДокументаПродажи.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТоварыДокументаПродажи.Характеристика КАК Характеристика,
	|	ТоварыДокументаПродажи.Назначение КАК Назначение,
	|	ТоварыДокументаПродажи.Серия КАК Серия,
	|	ТоварыДокументаПродажи.Упаковка КАК Упаковка,
	|	СУММА(ТоварыДокументаПродажи.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ТоварыДокументаПродажи.Количество) КАК Количество,
	|	СУММА(ТоварыДокументаПродажи.Сумма) КАК Сумма,
	|	ТоварыДокументаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТоварыДокументаПродажи.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТоварыДокументаПродажи.СуммаСНДС) КАК СуммаСНДС,
	|	ТоварыДокументаПродажи.Склад КАК Склад
	|ПОМЕСТИТЬ ТоварыРеализации
	|ИЗ
	|	ТоварыДокументаПродажи КАК ТоварыДокументаПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ВариантыКомплектацииНоменклатуры.Владелец = ТоварыДокументаПродажи.НоменклатураНабора
	|			И ВариантыКомплектацииНоменклатуры.Характеристика = ТоварыДокументаПродажи.ХарактеристикаНабора
	|			И ВариантыКомплектацииНоменклатуры.Основной
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокументаПродажи.АналитикаУчетаНаборов,
	|	ТоварыДокументаПродажи.НоменклатураНабора,
	|	ТоварыДокументаПродажи.ХарактеристикаНабора,
	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.СодержитУслуги, ЛОЖЬ),
	|	ТоварыДокументаПродажи.АналитикаУчетаНоменклатуры,
	|	ТоварыДокументаПродажи.Номенклатура,
	|	ТоварыДокументаПродажи.ТипНоменклатуры,
	|	ТоварыДокументаПродажи.Характеристика,
	|	ТоварыДокументаПродажи.Назначение,
	|	ТоварыДокументаПродажи.Серия,
	|	ТоварыДокументаПродажи.Упаковка,
	|	ТоварыДокументаПродажи.СтавкаНДС,
	|	ТоварыДокументаПродажи.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНаборов,
	|	АналитикаУчетаНоменклатуры,
	|	Упаковка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 6
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КлючиАналитикиНаборов.Ссылка, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНаборов.ПустаяСсылка)) КАК АналитикаУчетаНаборов,
	|	ЕСТЬNULL(КлючиАналитикиНаборов.НоменклатураНабора, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураНабора,
	|	ЕСТЬNULL(КлючиАналитикиНаборов.ХарактеристикаНабора, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНабора,
	|	ТоварыВозвратов.АналитикаУчетаНоменклатурыОтгрузки КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура КАК Номенклатура,
	|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	КлючиАналитики.Характеристика КАК Характеристика,
	|	КлючиАналитики.Назначение КАК Назначение,
	|	КлючиАналитики.Серия КАК Серия,
	|	ТоварыВозвратов.Упаковка КАК Упаковка,
	|	СУММА(ТоварыВозвратов.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ТоварыВозвратов.Количество) КАК Количество,
	|	СУММА(ТоварыВозвратов.СуммаСНДС - ТоварыВозвратов.СуммаНДС) КАК Сумма,
	|	ТоварыВозвратов.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТоварыВозвратов.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТоварыВозвратов.СуммаСНДС) КАК СуммаСНДС,
	|	КлючиАналитики.МестоХранения КАК Склад
	|ПОМЕСТИТЬ ТоварыПредыдущихВозвратов
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ТоварыВозвратов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументовСторноИсправление
	|		ПО ТоварыВозвратов.Ссылка = РеестрДокументовСторноИсправление.СторнируемыйДокумент
	|			И РеестрДокументовСторноИсправление.Проведен
	|			И НЕ РеестрДокументовСторноИсправление.ДополнительнаяЗапись
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНаборов КАК КлючиАналитикиНаборов
	|		ПО ТоварыВозвратов.АналитикаУчетаНаборов = КлючиАналитикиНаборов.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТоварыВозвратов.АналитикаУчетаНоменклатурыОтгрузки = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО КлючиАналитики.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	ТоварыВозвратов.Ссылка.Проведен
	|	И РеестрДокументовСторноИсправление.Ссылка ЕСТЬ NULL
	|	И ТоварыВозвратов.ДокументРеализации = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(КлючиАналитикиНаборов.Ссылка, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНаборов.ПустаяСсылка)),
	|	ЕСТЬNULL(КлючиАналитикиНаборов.НоменклатураНабора, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ЕСТЬNULL(КлючиАналитикиНаборов.ХарактеристикаНабора, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|	ТоварыВозвратов.АналитикаУчетаНоменклатурыОтгрузки,
	|	КлючиАналитики.Номенклатура,
	|	СправочникНоменклатура.ТипНоменклатуры,
	|	КлючиАналитики.Характеристика,
	|	КлючиАналитики.Назначение,
	|	КлючиАналитики.Серия,
	|	ТоварыВозвратов.Упаковка,
	|	ТоварыВозвратов.СтавкаНДС,
	|	КлючиАналитики.МестоХранения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНаборов,
	|	АналитикаУчетаНоменклатуры,
	|	Упаковка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 7
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыРеализации.АналитикаУчетаНаборов, ТоварыПредыдущихВозвратов.АналитикаУчетаНаборов) КАК АналитикаУчетаНаборов,
	|	ЕСТЬNULL(ТоварыРеализации.НоменклатураНабора, ТоварыПредыдущихВозвратов.НоменклатураНабора) КАК НоменклатураНабора,
	|	ЕСТЬNULL(ТоварыРеализации.НоменклатураНабора.Наименование, ТоварыПредыдущихВозвратов.НоменклатураНабора.Наименование) КАК НоменклатураНабораПредставление,
	|	ЕСТЬNULL(ТоварыРеализации.ХарактеристикаНабора, ТоварыПредыдущихВозвратов.ХарактеристикаНабора) КАК ХарактеристикаНабора,
	|	ЕСТЬNULL(ТоварыРеализации.ХарактеристикаНабора.Наименование, ТоварыПредыдущихВозвратов.ХарактеристикаНабора.Наименование) КАК ХарактеристикаНабораПредставление,
	|	ЕСТЬNULL(ТоварыРеализации.НаборСодержитУслуги, ЛОЖЬ) КАК НаборСодержитУслуги,
	|	ЕСТЬNULL(ТоварыРеализации.Номенклатура, ТоварыПредыдущихВозвратов.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыРеализации.Номенклатура.Наименование, ТоварыПредыдущихВозвратов.Номенклатура.Наименование) КАК НоменклатураПредставление,
	|	ЕСТЬNULL(ТоварыРеализации.АналитикаУчетаНоменклатуры, ТоварыПредыдущихВозвратов.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ТоварыРеализации.ТипНоменклатуры, ТоварыПредыдущихВозвратов.ТипНоменклатуры) КАК ТипНоменклатуры,
	|	ЕСТЬNULL(ТоварыРеализации.Характеристика, ТоварыПредыдущихВозвратов.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ТоварыРеализации.Характеристика.Наименование, ТоварыПредыдущихВозвратов.Характеристика.Наименование) КАК ХарактеристикаПредставление,
	|	ЕСТЬNULL(ТоварыРеализации.Назначение, ТоварыПредыдущихВозвратов.Назначение) КАК Назначение,
	|	ЕСТЬNULL(ТоварыРеализации.Серия, ТоварыПредыдущихВозвратов.Серия) КАК Серия,
	|	ЕСТЬNULL(ТоварыРеализации.Серия.Наименование, ТоварыПредыдущихВозвратов.Серия.Наименование) КАК СерияПредставление,
	|	ЕСТЬNULL(ТоварыРеализации.Количество, 0) - ЕСТЬNULL(ТоварыПредыдущихВозвратов.Количество, 0) КАК Количество,
	|	0 КАК КоличествоУпаковок,
	|	ЕСТЬNULL(ТоварыРеализации.Упаковка, ТоварыПредыдущихВозвратов.Упаковка) КАК Упаковка,
	|	ЕСТЬNULL(ТоварыРеализации.Упаковка.Наименование, ТоварыПредыдущихВозвратов.Упаковка.Наименование) КАК УпаковкаПредставление,
	|	ЕСТЬNULL(ТоварыРеализации.СтавкаНДС, ТоварыПредыдущихВозвратов.СтавкаНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(ТоварыРеализации.Сумма, 0) - ЕСТЬNULL(ТоварыПредыдущихВозвратов.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ТоварыРеализации.СуммаНДС, 0) - ЕСТЬNULL(ТоварыПредыдущихВозвратов.СуммаНДС, 0) КАК СуммаНДС,
	|	ЕСТЬNULL(ТоварыРеализации.СуммаСНДС, 0) - ЕСТЬNULL(ТоварыПредыдущихВозвратов.СуммаСНДС, 0) КАК СуммаСНДС,
	|	&ДокументОснование КАК ДокументРеализации,
	|	ЕСТЬNULL(ТоварыРеализации.Склад, ТоварыПредыдущихВозвратов.Склад) КАК Склад
	|ИЗ
	|	ТоварыРеализации КАК ТоварыРеализации
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыПредыдущихВозвратов КАК ТоварыПредыдущихВозвратов
	|		ПО ТоварыРеализации.АналитикаУчетаНаборов = ТоварыПредыдущихВозвратов.АналитикаУчетаНаборов
	|			И ТоварыРеализации.АналитикаУчетаНоменклатуры = ТоварыПредыдущихВозвратов.АналитикаУчетаНоменклатуры
	|			И ТоварыРеализации.Упаковка = ТоварыПредыдущихВозвратов.Упаковка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНабораПредставление,
	|	ХарактеристикаНабораПредставление,
	|	НоменклатураПредставление,
	|	ХарактеристикаПредставление,
	|	СерияПредставление,
	|	УпаковкаПредставление
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 8
	|ВЫБРАТЬ
	|	ПереданнаяВозвратнаяТараОстатки.Номенклатура КАК Номенклатура,
	|	ПереданнаяВозвратнаяТараОстатки.Характеристика КАК Характеристика,
	|	ПереданнаяВозвратнаяТараОстатки.Партнер КАК Партнер,
	|	ПереданнаяВозвратнаяТараОстатки.ДокументПередачи КАК ДокументПередачи,
	|	ПереданнаяВозвратнаяТараОстатки.КоличествоОстаток КАК Количество,
	|	ПереданнаяВозвратнаяТараОстатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ втПереданнаяВозвратнаяТара
	|ИЗ
	|	РегистрНакопления.ПереданнаяВозвратнаяТара.Остатки(, ДокументПередачи = &ДокументОснование) КАК ПереданнаяВозвратнаяТараОстатки
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 9
	|ВЫБРАТЬ
	|	втПереданнаяВозвратнаяТара.Номенклатура КАК Номенклатура,
	|	втПереданнаяВозвратнаяТара.Характеристика КАК Характеристика,
	|	втПереданнаяВозвратнаяТара.ДокументПередачи КАК ДокументРеализации,
	|	СУММА(втПереданнаяВозвратнаяТара.Количество) КАК Количество,
	|	СУММА(втПереданнаяВозвратнаяТара.Количество) КАК КоличествоУпаковок,
	|	СУММА(втПереданнаяВозвратнаяТара.Сумма) КАК Сумма,
	|	СУММА(втПереданнаяВозвратнаяТара.Сумма) КАК СуммаСНДС,
	|	ВЫБОР
	|		КОГДА СУММА(втПереданнаяВозвратнаяТара.Количество) = 0
	|			ТОГДА СУММА(втПереданнаяВозвратнаяТара.Сумма)
	|		ИНАЧЕ СУММА(втПереданнаяВозвратнаяТара.Сумма) / СУММА(втПереданнаяВозвратнаяТара.Количество)
	|	КОНЕЦ КАК Цена,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС) КАК СтавкаНДС
	|ИЗ
	|	втПереданнаяВозвратнаяТара КАК втПереданнаяВозвратнаяТара
	|
	|СГРУППИРОВАТЬ ПО
	|	втПереданнаяВозвратнаяТара.Номенклатура,
	|	втПереданнаяВозвратнаяТара.Характеристика,
	|	втПереданнаяВозвратнаяТара.ДокументПередачи
	|
	|ИМЕЮЩИЕ
	|	СУММА(втПереданнаяВозвратнаяТара.Количество) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ДокументРеализации";

	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ВводитьНаОснованииНепроведенного", ВводитьНаОснованииНепроведенного);

	УстановитьПривилегированныйРежим(Истина);
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);

	ВыборкаШапка = ПакетЗапросов[1].Выбрать();
	ВыборкаШапка.Следующий();

	ВыборкаРасчетыПоОснованию = ПакетЗапросов[2].Выбрать();

	МассивДопустимыхСтатусов = Новый Массив;
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено);

	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
	ВыборкаШапка.Ссылка,
	ВыборкаШапка.СтатусДокумента,
	ВыборкаШапка.ЕстьОшибкиПроведен,
	ВыборкаШапка.ЕстьОшибкиСтатус,
	МассивДопустимыхСтатусов);

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);

	ХозяйственнаяОперация = ПродажиСервер.ПолучитьХозяйственнуюОперациюВозвратаПоРеализации(ВыборкаШапка.ХозяйственнаяОперацияРеализация);

	КлючиПоиска = "АналитикаУчетаНоменклатуры, АналитикаУчетаНаборов, СтавкаНДС";

	ТаблицаТоваров = ПакетЗапросов[7].Выгрузить(); // ТаблицаЗначений -
	ТаблицаТоваров.Индексы.Добавить(КлючиПоиска);

	СтруктураПоиска = Новый Структура(КлючиПоиска);

	Для Каждого Строка Из ТаблицаТоваров Цикл
		Если Строка.Количество < 0 Тогда
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
			СтрокиПродажи = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);

			Для Каждого СтрокаПродажи Из СтрокиПродажи Цикл
				Если СтрокаПродажи.Количество < 0 Тогда
					Продолжить;
				КонецЕсли;

				Строка.Количество	= -Строка.Количество;
				Строка.Сумма		= -Строка.Сумма;
				Строка.СуммаНДС		= -Строка.СуммаНДС;
				Строка.СуммаСНДС	= -Строка.СуммаСНДС;

				Если Строка.Количество > СтрокаПродажи.Количество Тогда
					КоличествоНаВычет	= СтрокаПродажи.Количество;
					СуммаНаВычет		= СтрокаПродажи.Сумма;
					СуммаНДСНаВычет	= СтрокаПродажи.СуммаНДС;
					СуммаСНДСНаВычет	= СтрокаПродажи.СуммаСНДС;
				Иначе
					КоличествоНаВычет	= Строка.Количество;
					СуммаНаВычет		= Строка.Сумма;
					СуммаНДСНаВычет	= Строка.СуммаНДС;
					СуммаСНДСНаВычет	= Строка.СуммаСНДС;
				КонецЕсли;

				СтрокаПродажи.Количество	= СтрокаПродажи.Количество - КоличествоНаВычет;
				Строка.Количество			= Строка.Количество - КоличествоНаВычет;

				СтрокаПродажи.Сумма			= СтрокаПродажи.Сумма - СуммаНаВычет;
				Строка.Сумма				= Строка.Сумма - СуммаНаВычет;

				СтрокаПродажи.СуммаНДС		= СтрокаПродажи.СуммаНДС - СуммаНДСНаВычет;
				Строка.СуммаНДС				= Строка.СуммаНДС - СуммаНДСНаВычет;

				СтрокаПродажи.СуммаСНДС		= СтрокаПродажи.СуммаСНДС - СуммаСНДСНаВычет;
				Строка.СуммаСНДС			= Строка.СуммаСНДС - СуммаСНДСНаВычет;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого Строка Из ТаблицаТоваров Цикл
		Если Строка.Количество <= 0 Тогда
			МассивУдаляемыхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Строка Из МассивУдаляемыхСтрок Цикл
		ТаблицаТоваров.Удалить(Строка);
	КонецЦикла;

	ТаблицаТоваров.Колонки.Удалить("АналитикаУчетаНаборов");
	ТаблицаТоваров.Колонки.Удалить("АналитикаУчетаНоменклатуры");

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТаблицаТоваров, СтруктураДействий);

	Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
		Если ТекСтрока.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар
			И Не ЗначениеЗаполнено(ТекСтрока.НоменклатураНабора)
			Или (ТекСтрока.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара
			И Не ВыборкаШапка.ВозвратПереданнойМногооборотнойТары)
			И Не ЗначениеЗаполнено(ТекСтрока.НоменклатураНабора)
			Или ЗначениеЗаполнено(ТекСтрока.НоменклатураНабора)
			И Не ТекСтрока.НаборСодержитУслуги Тогда

			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);

			НоваяСтрока.СпособОпределенияСебестоимости =
			?(ЗначениеЗаполнено(НоваяСтрока.ДокументРеализации),
			Перечисления.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи,
			Перечисления.СпособыОпределенияСебестоимостиВозврата.ИзТекущегоДокумента);

			Ценообразование.ПересчитатьСуммыВСтрокеПоСуммеСНДС(
			НоваяСтрока,
			ВыборкаШапка.ЦенаВключаетНДС,
			Ложь,
			Ложь,
			Истина);

		КонецЕсли;
	КонецЦикла;

	ТаблицаТары = ПакетЗапросов[9].Выгрузить();

	Для Каждого ТекущаяСтрока Из ТаблицаТары Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрока);

		НоваяСтрока.СпособОпределенияСебестоимости =
		?(ЗначениеЗаполнено(НоваяСтрока.ДокументРеализации),
		Перечисления.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи,
		Перечисления.СпособыОпределенияСебестоимостиВозврата.ИзТекущегоДокумента);

		Ценообразование.ПересчитатьСуммыВСтрокеПоСуммеСНДС(НоваяСтрока, ВыборкаШапка.ЦенаВключаетНДС, Ложь, Ложь, Истина);
	КонецЦикла;

	ЗаполнитьНомераГТДПоРаспоряжениям(ВыборкаШапка.ЦенаВключаетНДС);
	ЗаполнитьВзаиморасчеты(ВыборкаРасчетыПоОснованию);

КонецПроцедуры
